---
kind: method
id: M:Autodesk.Revit.DB.OrdinateDimensionSetting.Dispose
source: html/e1714434-969d-9d87-89b2-b93597755138.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.Dispose Method

Releases all resources used by the OrdinateDimensionSetting

## Syntax (C#)
```csharp
public void Dispose()
```